Pandas - Dataframe and series

In [56]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [57]:
# Series from dictionary 
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [58]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data, index = index)

a    10
b    20
c    30
dtype: int64

In [59]:
# Dataframe
# Create a dataframe from a dictionary or list
data = {
    "Name" : ["Pulkit","Lucas","Jude"],
    "Age" : [22,39,25],
    "City" : ["NY","Mardid","Manchester"]
}
df = pd.DataFrame(data)
series = pd.Series(data)
print(series)
print(df)
print(type(df))

Name       [Pulkit, Lucas, Jude]
Age                 [22, 39, 25]
City    [NY, Mardid, Manchester]
dtype: object
     Name  Age        City
0  Pulkit   22          NY
1   Lucas   39      Mardid
2    Jude   25  Manchester
<class 'pandas.core.frame.DataFrame'>

In [60]:
import numpy as np
np.array(df)

array([['Pulkit', 22, 'NY'],
       ['Lucas', 39, 'Mardid'],
       ['Jude', 25, 'Manchester']], dtype=object)

In [61]:
# Create a dataframe from a list of dictionaries
data = [
    {"Name" :"Pulkit", "Age" : 22, "City" : "Delhi"},
    {"Name" :"Coutrois", "Age" : 38, "City" : "Brussels"},
    {"Name" :"Mbappe", "Age" : 25, "City" : "Paris"}
]
df = pd.DataFrame(data)
print(df)

       Name  Age      City
0    Pulkit   22     Delhi
1  Coutrois   38  Brussels
2    Mbappe   25     Paris

In [62]:
type(df["Name"])

pandas.core.series.Series

In [63]:
df.loc[0][1]

C:\Users\91767\AppData\Local\Temp\ipykernel_38808\395987507.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][1]

22

In [64]:
df.iloc[1][2]

C:\Users\91767\AppData\Local\Temp\ipykernel_38808\65333983.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

'Brussels'

In [65]:
# Accessing a specified element 
df.at[1,"Age"]

38

In [66]:
# Accesing specifed element using iat
df.iat[2,2]

'Paris'

In [67]:
# Data manipulation with DataFrames
df

       Name  Age      City
0    Pulkit   22     Delhi
1  Coutrois   38  Brussels
2    Mbappe   25     Paris

In [68]:
df['Salary'] = [10000,60000,90000]
df

       Name  Age      City  Salary
0    Pulkit   22     Delhi   10000
1  Coutrois   38  Brussels   60000
2    Mbappe   25     Paris   90000

In [69]:
# Remove a column
df.drop("Salary",axis = 1,inplace = True)

# Axis = 0 for dropping column, Axis = 1 for dropping a row
# Inplace = True is used to permanently save the changes made

In [70]:
df['Age'] = df['Age']+1
df

       Name  Age      City
0    Pulkit   23     Delhi
1  Coutrois   39  Brussels
2    Mbappe   26     Paris

In [72]:
df.drop(0, inplace = True)
df

       Name  Age      City
1  Coutrois   39  Brussels
2    Mbappe   26     Paris